[
    {
        "university_title": "COMSATS University",
        "main_link": "https://www.comsats.edu.pk/",
        "social_links": {
            "instagram_link": "https://www.instagram.com/cuinews",
            "facebook_link": "https://www.facebook.com/cuiofficial/",
            "twitter_link": "https://twitter.com/CUIofficial",
            "youtube_link": "https://www.youtube.com/@cuiofficial"
        },
        "ranking": "not known",
        "contact_details": {
            "info_email": " rizwan_ahmed@comsats.edu.pk",
            "call": " (92-51) 9049 5032-5\r\n"
        },
        "introduction": "Historical Perspective The Commission on Science and Technology for Sustainable Development in the South (COMSATS) is an international organization. It aims to reduce the ever-growing gap between the developed and developing world through useful applications of science and technology. The Third World Academy of Sciences (TWAS) initiated the proposal for the formation of COMSATS under the leadership of Nobel Laureate, Dr. Abdus Salam. The foundation-conference of COMSATS was held at Islamabad on 4th & 5th October 1994. Representatives from thirty-six countries attended. The participants included twenty-two Ministers, members of the diplomatic community of Islamabad and representatives of international organizations, like UNESCO, UNIDO, UNEP and the World Bank. The conference decided that the Headquarters / Secretariat of the Commission would be based permanently at Islamabad, Pakistan, and the Head of State of Pakistan would act as the first Chairperson of the forum. It was agreed that the host -Government, Pakistan, would provide for the operational and administrative expenses of the Secretariat, while the development programs of the Commission would be supported and financed through Technical Assistance Fund. This fund would be established by contribution from member countries, income from services provided to member countries, grants from international agencies and project funds, if under taken under contract. Learn more"
    }
]