[
    {
        "university_title": "UMT - University of Management and Technology",
        "main_link": "https://umt.edu.pk/",
        "social_links": {
            "instagram": "https://www.instagram.com/umtofficial/",
            "facebook": "https://www.facebook.com/umtofficial",
            "twitter": "https://twitter.com/UMTOfficial",
            "youtube": "https://www.youtube.com/umtofficial",
            "linkedin": "https://www.linkedin.com/school/673280/"
        },
        "ranking": "not known",
        "contact_details": {
            "info_email": "info@ucp.du.pk",
            "call": "+92 42 35212801-10"
        },
        "introduction": "The Journey from ILM to UMT UMT is a project of the Institute of Leadership and Management (ILM) Trust. ILM was established in 1990 by leading educationists, professionals, and industrialists with an aim to enhance organizational and individual effectiveness. Guided by the noble mission of helping others in actualizing their limitless human potential to its finest shape, ILM sought to respond to the challenges of information-based economy, globalization, and ever-increasing complexity. The University of Management and Technology has evolved into a premier institution of higher learning in the country. It is recognized by the Higher Education Commission (HEC) as a 'W4' category (highest rank) university. For more than two years, UMT was also at the top as per HEC ranking in General Category (medium-sized) of private sector institutions in the Punjab. UMT was placed among the top 600 HEI of the world for societal impact in the THE impact rankings 2020. UMT has also been named among the top 500 in QS Asia University Rankings 2021. UMT also got nominated for the Times Higher Education Award Asia 2020 in the Workplace of the year category. UMT – now an independent, not-for-profit, private institution of higher learning – received her degree-granting charter first as the Institute of Management and Technology (IMT) in 2002 through an Act of the Assembly of the Punjab. Later, on June 16, 2004, IMT became the University of Management and Technology through the passing of a similar Act by the Punjab Assembly. In September 2007, the Higher Education Commission (HEC), Pakistan, upgraded the category of UMT from ‘Category X’/ previous ‘Category B’ to ‘Category W’/ previous ‘Category A’. UMT Intro Presentation",
       
    }
]